#+Title: Tour Guiado pelo Emacs
#+Author: Daniel Cordeiro
#+Email: daniel.cordeiro@usp.br
#+STARTUP: inlineimages

** Extensibilidade

Alguns exemplos de como o emacs pôde ser estendido para implementar as mais diversas aplicações:

- Emacspeak :: um software de 25+ anos para ajudar quem tem problemas de visão a usar emacs

- Edição remota de arquivos :: TRAMP permite você editar arquivos em outros computadores como se estivesse editando um arquivo local via SSH, FTP, Docker, rclone, rsync, etc.
  ex: [[/ssh:corinthians:teste.txt]]

- Shell(s) :: Emacs possui um emulador de terminal embutido, um wrapper que permite usar outros shells (como bash) e um próprio shell turbinado chamado Eshell escrito inteiramente em elisp

- Org mode :: uma aplicação de gerenciamento de projetos, TODOs, agenda, programação literária, editoramento, anotações, _apresentações_, etc. É considerado o melhor app de organização baseado em texto puro de todos os tempos, motivo de muita gente ter migrado para emacs nos últimos tempos.

- Calculadora simbólica :: calculadora capaz de realizar álgebra simbólica, computação de precisão arbitrária, matemática matricial e unitária, etc.

| Aluno  | Intro.Programação | Algoritmos | Média |
|--------+-------------------+------------+-------|
| Daniel |               9.5 |        9.5 |   9.5 |
| Tiago  |                 8 |         10 |     9 |
| Rafael |                 7 |          2 |   4.5 |
#+TBLFM: $4=vmean($2..$3)

- Player de Música :: Emacs Multimedia System (EMMS)

- e *muito* mais. Emacs continua relevante mesmo em 2022!

